
{
  "events": [
    {
      "id": "1",
      "slug": "marrakech-international-film-festival",
      "title": "Marrakech International Film Festival",
      "subtitle": "Annual celebration of world cinema featuring screenings, workshops, and celebrity appearances",
      "description": "The Marrakech International Film Festival is one of the most prestigious film festivals in Africa and the Middle East. Established in 2001, this annual celebration brings together filmmakers, actors, and cinema enthusiasts from around the world. The festival features screenings of films from diverse cultures, masterclasses with renowned directors, and panel discussions on the art and business of filmmaking. Each year, the festival attracts Hollywood stars and international celebrities who walk the red carpet at the opening and closing ceremonies. Beyond the glamour, the festival is committed to promoting Moroccan cinema and providing a platform for emerging talents from the region.",
      "image": "https://images.unsplash.com/photo-1594909122845-11baa439b7bf?q=80&w=2070&auto=format&fit=crop",
      "startDate": "2024-12-02T18:00:00.000Z",
      "endDate": "2024-12-10T23:00:00.000Z",
      "city": "Marrakech",
      "location": "Palais des Congrès, Marrakech",
      "category": "Cultural",
      "organizer": "Marrakech Film Festival Foundation",
      "createdAt": "2024-05-15T10:30:00.000Z",
      "status": "approved",
      "userId": "1",
      "updatedAt": "2024-05-15T10:30:00.000Z",
      "coordinates": {
        "lat": 31.6295,
        "lng": -7.9811
      }
    },
    {
      "id": "2",
      "slug": "gnaoua-world-music-festival",
      "title": "Gnaoua World Music Festival",
      "subtitle": "Essaouira's celebration of Gnaoua music traditions and global cultural exchange",
      "description": "The Gnaoua World Music Festival is one of Morocco's most vibrant and culturally significant musical events. Held annually in the coastal city of Essaouira, this festival celebrates the rich tradition of Gnaoua music, a unique genre with roots in sub-Saharan Africa that blends spiritual rhythms, acrobatic dancing, and colorful costumes. Over four days, the festival transforms Essaouira into a hub of music and cultural exchange, with performances taking place in historic venues throughout the medina. Beyond traditional Gnaoua music, the festival features collaborations between Gnaoua masters and international artists from jazz, blues, reggae, and other world music genres. This fusion of musical traditions has made the festival a powerful symbol of cross-cultural dialogue and artistic innovation.",
      "image": "https://images.unsplash.com/photo-1511192336575-5a79af67a629?q=80&w=2070&auto=format&fit=crop",
      "startDate": "2024-06-28T16:00:00.000Z",
      "endDate": "2024-06-30T23:59:00.000Z",
      "city": "Essaouira",
      "location": "Moulay Hassan Square, Essaouira",
      "category": "Music",
      "organizer": "A3 Association",
      "createdAt": "2024-04-10T14:15:00.000Z",
      "status": "approved",
      "userId": "1",
      "updatedAt": "2024-04-10T14:15:00.000Z",
      "coordinates": {
        "lat": 31.5118,
        "lng": -9.7692
      }
    },
    {
      "id": "3",
      "slug": "fes-festival-of-sacred-music",
      "title": "Fes Festival of Sacred Music",
      "subtitle": "A spiritual journey through diverse religious and cultural musical traditions",
      "description": "The Fes Festival of Sacred Music is a renowned annual event that brings together musicians and artists from diverse spiritual traditions around the world. Founded in 1994, this prestigious festival takes place in the ancient imperial city of Fes, a UNESCO World Heritage site known for its rich cultural heritage and well-preserved medieval architecture. The festival celebrates the universal language of sacred music as a means of promoting dialogue, understanding, and peace between different cultures and religions. Each edition features performances by artists representing various spiritual traditions, including Sufi mysticism, Andalusian classical music, Gregorian chants, Hindu devotional songs, and Buddhist ceremonial music. Concerts are held in historic venues throughout the city, including the magnificent Bab Al Makina, an open-air venue framed by the walls of the Royal Palace.",
      "image": "https://images.unsplash.com/photo-1612438214708-f428a707dd7e?q=80&w=2071&auto=format&fit=crop",
      "startDate": "2024-05-19T17:00:00.000Z",
      "endDate": "2024-05-27T22:00:00.000Z",
      "city": "Fes",
      "location": "Bab Al Makina, Fes",
      "category": "Music",
      "organizer": "Fes Foundation for Culture and Sacred Arts",
      "createdAt": "2024-02-25T09:45:00.000Z",
      "status": "approved",
      "userId": "2",
      "updatedAt": "2024-02-25T09:45:00.000Z",
      "coordinates": {
        "lat": 34.0181,
        "lng": -5.0078
      }
    }
  ]
}
